app/Models/M_Menu.php

    public function getAllData()
    {
        return $this->findAll(); // Menggunakan method bawaan untuk mengambil semua data
---
SELECT *
FROM `menu`