app/Models/M_Pengeluaran.php

SELECT *
FROM `pengeluaran`
---
    public function getAllData()
    {
        return $this->findAll(); // Menggunakan method bawaan untuk mengambil semua data